W6D3/first_routes_and_controllers/app/controllers/art_works_controller.rb

  def index
    # @art_works = ArtWork.find(params[:user_id])
    user = User.find(params[:user_id])
    if user.artworks.empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "art_works".* FROM "art_works"

  def show
    @art_work = ArtWork.find(params[:id])
---
SELECT  "art_works".* FROM "art_works" WHERE "art_works"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @art_work = ArtWork.find(params[:id])
    if @art_work.update(art_work_params)
---
SELECT  "art_works".* FROM "art_works" WHERE "art_works"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "art_works" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "art_works"."id" = $4  [["title", "Ice Cream"], ["image_url", "url3"], ["updated_at", "2021-06-17 19:10:18.018565"], ["id", 3]]