W6D3/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
  def index
    @artwork_shares = ArtworkShare.all

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @artwork_share = ArtworkShare.find(params[:id])

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "viewer_id" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["viewer_id", 6], ["updated_at", "2021-06-17 21:35:09.165334"], ["id", 1]]
---
  def update
    @artwork_share = ArtworkShare.find(params[:id])
    if @artwork_share.update(artwork_share_params)

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
  def destroy
    @artwork_share = ArtworkShare.find(params[:id])
    @artwork_share.destroy