W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-06-17 20:51:50.105871"], ["updated_at", "2021-06-17 20:51:50.105871"], ["username", "Trustin"]]